src/DataProcessors/РабочееМестоУД_МастерДД/РабочееМестоУД_МастерДД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоУД_МастерДД</name>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаКанбан</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКанбана</name>
    <type>
      <types>CatalogRef.ВидыКанбанов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/Enums/ВидыЛинеек/ВидыЛинеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЛинеек</name>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Канбан</name>
  </enumValues>
  <enumValues>
    <name>Переупаковка</name>
  </enumValues>
</mdclass:Enum>

src/Documents/МаршрутнаяКарта/МаршрутнаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутнаяКарта</name>
  <basedOn>Document.ЗаказНаПроизводство</basedOn>
  <basedOn>Document.РемонтнаяКарта</basedOn>
  <basedOn>Document.СписаниеМПЗПрочее</basedOn>
  <registerRecords>AccumulationRegister.МестаХранения</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланыВыпуска</registerRecords>
  <registerRecords>AccumulationRegister.ПередачиВПроизводство</registerRecords>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РемонтнаяКарта</types>
      <types>DocumentRef.СписаниеМПЗПрочее</types>
      <types>DocumentRef.ЗаявкаОтПокупателя</types>
      <types>DocumentRef.МаршрутнаяКарта</types>
      <types>DocumentRef.ЗаказНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОчереди</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛинейкаИнициатор</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияПотребитель</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЯчейки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Счёт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ремонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредполагаемогоОкончанияОстановки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОстановки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МПЗОстановки</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйКомментарий</name>
    <type>
      <types>CatalogRef.СтандартныеКомментарии</types>
    </type>
  </attributes>
  <attributes>
    <name>Выгружено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаРасходов</name>
      <type>
        <types>CatalogRef.НормыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНормыРасходов</name>
      <type>
        <types>CatalogRef.АналогиНормРасходов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехОперации</name>
    <attributes>
      <name>ТехОперация</name>
      <type>
        <types>CatalogRef.ТехОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Остановки</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияПредполагаемая</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Причина</name>
      <type>
        <types>CatalogRef.ПричиныОстановок</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МПЗ</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Инициатор</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочееМесто</name>
      <type>
        <types>CatalogRef.РабочиеМестаЛинеек</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/DataProcessors/РабочееМестоУД_МастерДД/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
СортироватьПо = 1;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛО(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛьготнаяОчередьСрезПоследних.ПЗ
	|ИЗ
	|	РегистрСведений.ЛьготнаяОчередь.СрезПоследних КАК ЛьготнаяОчередьСрезПоследних
	|ГДЕ
	|	ЛьготнаяОчередьСрезПоследних.ПЗ = &ПЗ
	|	И ЛьготнаяОчередьСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
Запрос.УстановитьПараметр("ПЗ", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Истина);
	КонецЦикла;
	Возврат(Ложь);
КонецФункции 

&НаСервере
Функция ПолучитьРемонт(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = &ПЗ
	|	И ЭтапыПроизводственныхЗаданийСрезПоследних.Ремонт = ИСТИНА";
Запрос.УстановитьПараметр("ПЗ", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Истина);
	КонецЦикла;
	Возврат(Ложь);
КонецФункции

&НаСервере
Функция ПолучитьТекущийЭтапПЗ(ПЗ)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.РабочееМесто,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаНачала,
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ДатаОкончания
	|ИЗ
	|	РегистрСведений.ЭтапыПроизводственныхЗаданий.СрезПоследних КАК ЭтапыПроизводственныхЗаданийСрезПоследних
	|ГДЕ
	|	ЭтапыПроизводственныхЗаданийСрезПоследних.ПЗ = &ПЗ";
Запрос.УстановитьПараметр("ПЗ", ПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Новый Структура("РабочееМесто,ДатаНачала,ДатаОкончания",ВыборкаДетальныеЗаписи.РабочееМесто,ВыборкаДетальныеЗаписи.ДатаНачала,ВыборкаДетальныеЗаписи.ДатаОкончания));
	КонецЦикла;
КонецФункции

&НаСервере
Процедура ПолучитьПЗКанбан(МТК,СтрМТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственноеЗадание.Ссылка
	|ИЗ
	|	Документ.ПроизводственноеЗадание КАК ПроизводственноеЗадание
	|ГДЕ
	|	ПроизводственноеЗадание.ДокументОснование.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СтрПЗ = СтрМТК.Строки.Добавить();
	СтрПЗ.Документ = ВыборкаДетальныеЗаписи.Ссылка;
	СтрПЗ.ВозвратнаяТара = ВыборкаДетальныеЗаписи.Ссылка.ВозвратнаяТара;
	СтрПЗ.Количество = ВыборкаДетальныеЗаписи.Ссылка.Количество;
	СтрПЗ.Изделие = ВыборкаДетальныеЗаписи.Ссылка.Изделие;
	СтрПЗ.ЛО = ПолучитьЛО(ВыборкаДетальныеЗаписи.Ссылка);
	СтрПЗ.Ремонт = ПолучитьРемонт(ВыборкаДетальныеЗаписи.Ссылка);
	ЭПЗ = ПолучитьТекущийЭтапПЗ(ВыборкаДетальныеЗаписи.Ссылка);
	СтрПЗ.РабочееМесто = ЭПЗ.РабочееМесто;
	СтрПЗ.ДатаНачала = ЭПЗ.ДатаНачала;
	СтрПЗ.ДатаОкончания = ЭПЗ.ДатаОкончания;
	СтрПЗ.Статус = -1;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Функция ПолучитьНезавершённоеКоличествоПоПодчиненнымМТК(МТК)
Запрос = Новый Запрос;

Количество = 0;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Количество = Количество + ОбщийМодульВызовСервера.ПолучитьНезавершённоеКоличество(ТекущаяДата(),ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
Возврат(Количество);
КонецФункции 

&НаСервере
Функция ПолучитьКоличествоПеремещённых(МТК)
Запрос = Новый Запрос;

Количество = 0;
Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДвижениеМПЗТабличнаяЧасть.Количество КАК Количество
	|ИЗ
	|	Документ.ДвижениеМПЗ.ТабличнаяЧасть КАК ДвижениеМПЗТабличнаяЧасть
	|ГДЕ
	|	ДвижениеМПЗТабличнаяЧасть.Ссылка.ДокументОснование = &ДокументОснование
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ДвижениеМПЗТабличнаяЧасть.МПЗ";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаМПЗ = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
Количество = 0;
	Пока ВыборкаМПЗ.Следующий() Цикл
	Количество = Количество + ВыборкаМПЗ.Количество;	
	КонецЦикла;
Возврат(Количество);
КонецФункции 

&НаСервере
Процедура ОбновитьНаСервере()
тДерево = РеквизитФормыВЗначение("ДеревоМТК");
тДерево.Строки.Очистить();
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.Линейка = &Линейка
	|	И МаршрутнаяКарта.Статус <> 3";
Запрос.УстановитьПараметр("Линейка", Объект.Линейка);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СтрМТК = тДерево.Строки.Добавить();
	СтрМТК.Документ = ВыборкаДетальныеЗаписи.Ссылка;
	СтрМТК.Статус = ВыборкаДетальныеЗаписи.Ссылка.Статус;
	СтрМТК.Количество = ВыборкаДетальныеЗаписи.Ссылка.Количество;
	СтрМТК.Изделие = ВыборкаДетальныеЗаписи.Ссылка.Номенклатура;
	СтрМТК.НомерОчереди = ВыборкаДетальныеЗаписи.Ссылка.НомерОчереди;
	СтрМТК.Счёт = ВыборкаДетальныеЗаписи.Ссылка.Счёт;
	СтрМТК.ДатаОтгрузки = ВыборкаДетальныеЗаписи.Ссылка.ДатаОтгрузки;
	СтрМТК.ЛО = ПолучитьЛО(ВыборкаДетальныеЗаписи.Ссылка);
		Если СозданыПодчиненныеМТК(ВыборкаДетальныеЗаписи.Ссылка) Тогда
		СтрМТК.КоличествоВыпущено = ВыборкаДетальныеЗаписи.Ссылка.Количество - ПолучитьНезавершённоеКоличествоПоПодчиненнымМТК(ВыборкаДетальныеЗаписи.Ссылка);
		Иначе	
		СтрМТК.КоличествоВыпущено = ПолучитьКоличествоПеремещённых(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	СтрМТК.Комментарий = ВыборкаДетальныеЗаписи.Ссылка.Комментарий;
	ПолучитьПЗКанбан(ВыборкаДетальныеЗаписи.Ссылка,СтрМТК);
	КонецЦикла;
ЗначениеВРеквизитФормы(тДерево, "ДеревоМТК"); 
СортироватьПоПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоЛинейке() Экспорт
ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не Объект.Линейка.Пустая() Тогда
	ОбновитьНаСервере();
		Если Объект.ИнтервалОбновления > 0 Тогда
		ПодключитьОбработчикОжидания("ПолучитьДанныеПоЛинейке", Объект.ИнтервалОбновления*60);
		КонецЕсли;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОбновленияПриИзменении(Элемент)
	Если Не Объект.Линейка.Пустая() Тогда
	ОтключитьОбработчикОжидания("ПолучитьДанныеПоЛинейке");
		Если Объект.ИнтервалОбновления > 0 Тогда
		ПодключитьОбработчикОжидания("ПолучитьДанныеПоЛинейке", Объект.ИнтервалОбновления*60);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
ОбновитьНаСервере();
РазвернутьДерево(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьСпецификациюКанбана(Номенклатура)
ВыборкаНР = ОбщийМодульВызовСервера.ПолучитьНормыРасходовПоВладельцу_Н(Номенклатура,ТекущаяДата());
	Пока ВыборкаНР.Следующий() Цикл
		Если ВыборкаНР.Элемент.Канбан = Объект.ВидКанбана Тогда	
		Возврат(ВыборкаНР.Элемент);
		КонецЕсли; 
	КонецЦикла;
Возврат(Неопределено);
КонецФункции 

&НаСервере
Функция СозданыПодчиненныеМТК(МТК)
Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	МаршрутнаяКарта.Ссылка
	|ИЗ
	|	Документ.МаршрутнаяКарта КАК МаршрутнаяКарта
	|ГДЕ
	|	МаршрутнаяКарта.ДокументОснование = &ДокументОснование";
Запрос.УстановитьПараметр("ДокументОснование", МТК);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Возврат(Истина);
	КонецЦикла;
Возврат(Ложь);
КонецФункции 

&НаСервере
Процедура СоздатьМТККанбанаНаСервере(Документ)
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.МаршрутнаяКарта") Тогда
		Если Документ.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Продукция Тогда
			Если Не СозданыПодчиненныеМТК(Документ) Тогда
			Канбан = ПолучитьСпецификациюКанбана(Документ.Номенклатура);
				Если Канбан <> Неопределено Тогда
				ОбщийМодульСозданиеДокументов.СоздатьМТККанбан(Объект.ЛинейкаКанбан,Справочники.МестаХранения.ПустаяСсылка(),0,Канбан,Документ.Количество,,Документ);
				Иначе
				Сообщить(СокрЛП(Документ.Номенклатура.Наименование)+" - не найдено выбранного вида канбана!");
				КонецЕсли; 
			КонецЕсли;
		Возврат;
		КонецЕсли; 	
	КонецЕсли;
Сообщить("Выберите МТК линейки производства продукции!"); 
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМТККанбана(Команда)
	Если Найти(Элементы.ДеревоМТК.ТекущиеДанные.Комментарий,"Дополнительная МТК") = 0 Тогда
	СоздатьМТККанбанаНаСервере(Элементы.ДеревоМТК.ТекущиеДанные.Документ);
	Обновить(Неопределено);
	Иначе
	Сообщить("На дополнительные МТК не создаются МТК канбана.");
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура УдалитьМТК(Команда)
	Если ТипЗнч(Элементы.ДеревоМТК.ТекущиеДанные.Документ) = Тип("ДокументСсылка.МаршрутнаяКарта") Тогда
		Если Вопрос("Вы действительно хотите удалить МТК?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОбщийМодульВызовСервера.УдалитьЦепочкуДокументов(Элементы.ДеревоМТК.ТекущиеДанные.Документ);
		Обновить(Неопределено);
		КонецЕсли;
	Иначе
	Сообщить("Выберите строку с маршрутной картой!");
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СортироватьПоПриИзмененииНаСервере()
тДерево = РеквизитФормыВЗначение("ДеревоМТК");
	Если СортироватьПо = 1 Тогда
	тДерево.Строки.Сортировать("НомерОчереди");
	ИначеЕсли СортироватьПо = 2 Тогда
	тДерево.Строки.Сортировать("Изделие");
	ИначеЕсли СортироватьПо = 3 Тогда
	тДерево.Строки.Сортировать("ДатаОкончания",Истина);
	ИначеЕсли СортироватьПо = 4 Тогда
	тДерево.Строки.Сортировать("ДатаОтгрузки",Истина);
	КонецЕсли;
ЗначениеВРеквизитФормы(тДерево, "ДеревоМТК"); 
КонецПроцедуры

&НаКлиенте
Процедура СортироватьПоПриИзменении(Элемент)
СортироватьПоПриИзмененииНаСервере();
РазвернутьДерево(Неопределено); 
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Команда)
тЭлементы = ДеревоМТК.ПолучитьЭлементы();
   Для Каждого тСтр Из тЭлементы Цикл
   Элементы.ДеревоМТК.Развернуть(тСтр.ПолучитьИдентификатор(), Истина);
   КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Команда)
тЭлементы = ДеревоМТК.ПолучитьЭлементы();
   Для Каждого тСтр Из тЭлементы Цикл
   Элементы.ДеревоМТК.Свернуть(тСтр.ПолучитьИдентификатор());
   КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьВПроизводствоНаСервере(Документ)
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.МаршрутнаяКарта") Тогда
		Если Документ.Линейка.ВидЛинейки = Перечисления.ВидыЛинеек.Продукция Тогда
		МТК = Документ.ПолучитьОбъект();
		МТК.Статус = 4;
		МТК.Записать(РежимЗаписиДокумента.Проведение);
		Возврат;
		КонецЕсли; 	
	КонецЕсли;
Сообщить("Выберите МТК линейки производства продукции!");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьВПроизводство(Команда)
	Если Элементы.ДеревоМТК.ТекущиеДанные.Количество <> Элементы.ДеревоМТК.ТекущиеДанные.КоличествоВыпущено Тогда
		Если Вопрос("Требуемое количество по МТК продукции не равно количеству выпущенного канбана. 
					|Вы уверены, что хотите запустить МТК продукции в производство?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
		КонецЕсли; 
	КонецЕсли; 
ЗапуститьВПроизводствоНаСервере(Элементы.ДеревоМТК.ТекущиеДанные.Документ);
Обновить(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНаличиеПФНаСкладе(Команда)
	Если ОткрытьФормуМодально("Обработка.РабочееМестоУД_МастерДД.Форма.ПроверкаНаличияПФ",Новый Структура("МТК,ВидКанбана",Элементы.ДеревоМТК.ТекущиеДанные.Документ,Объект.ВидКанбана)) <> Неопределено Тогда
	Обновить(Неопределено);
	КонецЕсли;  
КонецПроцедуры
